[
    {
        "title": "IU Student Outreach Clinic Website",
        "link": "https://soc.iupui.edu",
        "img": "soc.png",
        "description": "I worked with a group of two other classmates to complete this website for our client, the IU Student Outreach Clinic. Using IU's WCMS (an off-shoot of the Cascade Content Management System), I developed and created content for several of the site's pages. "
    },
    {
        "title": "Easy Cards",
        "link": "https://in-info-web4.informatics.iupui.edu/~ebules/n423/final_bules/",
        "img": "easyCards.png",
        "description": "Created as a final project for NEWM-N423 in the Fall of 2022, Easy Cards is a fully featured Quizlet-like Study Tools application. I created the project with Firebase Authentication, Firestore db, and an OOP JavaScript MVC Architecture. <a href='https://github.com/elibules/n423-final-bules' target='_blank'>Check out the GitHub Repo here.</a>"
    },
    {
        "title": "Water St. CD & Vinyl",
        "link": "https://in-info-web4.informatics.iupui.edu/~ebules/n413_site_bules/",
        "img": "cdVinyl.png",
        "description": "Created as a final project for NEWM-N413 in the Spring of 2022, Water St. CD & Vinyl is a complete simulation of an e-commerce website. This site was built using the CodeIgniter PHP framework, MySql, and Javascript. Users can browse shop content, filter and sort the content, login/register an account, and view past orders if they have made any. <a href='https://github.com/elibules/waterst_php' target='_blank'>Check out the GitHub Repo here.</a>"
    },
    {
        "title": "Simple Weather App",
        "link": "https://elibules.github.io/simple_weather_app/",
        "img": "weather.png",
        "description": "As the title suggests, this is a simple weather website which allows the user to view the weather of any location as well as the forecast 3 days in advance. <a href='https://github.com/elibules/simple_weather_app' target='_blank'>Check out the GitHub Repo here.</a>"
    },
    {
        "title": "Go - ReactJS Micro Framework",
        "link": "https://github.com/elibules/go-react-framework",
        "img": "goReact.png",
        "description": "This is a web server written in Go that is built to serve a single-page application like React. The Go server, built in an MVC architecture, includes the ability to connect to a MySQL database. After the SPA in delivered to the client, the server will then serve as a RESTful API for the client side application. <a href='https://github.com/elibules/simple_weather_app' target='_blank'>Check out the GitHub Repo here.</a>"
    }
]